Repository: sandiz/Bit-Slicer
Catalog: Bit Slicer/*.lproj/[Code] Search Document.strings
Languages: ru

# scopeBarProtectionGroup
source: Protection:
ru: Защита на:

# scopeBarProtectionAllItem
source: All
ru: Все

# scopeBarProtectionWriteItem
source: Write
ru: Запись

# scopeBarProtectionExecuteItem
source: Execute
ru: Выполнение

# scopeBarQualifierGroup
source: Qualifier:
ru: Целочисленный тип:

# scopeBarQualifierSignedItem
source: Signed
ru: Знаковый

# scopeBarQualifierUnsignedItem
source: Unsigned
ru: Не знаковый

# scopeBarStringMatchingGroup
source: Matching:
ru: Параметры строк:

# scopeBarStringMatchingIgnoreCaseItem
source: Ignore Case
ru: Не учитывать регистр

# scopeBarStringMatchingNullTerminatedItem
source: Null Terminated
ru: Нуль-терминальные

# scopeBarEndiannessGroup
source: Endianness:
ru: Порядок байтов:

# scopeBarEndianLittleItem
source: Little
ru: Прямой

# scopeBarEndianBigItem
source: Big
ru: Обратный

# searchBelowLabel
source: Below
ru: но меньше

# searchAboveLabel
source: Above
ru: но больше

# searchRoundErrorLabel
source: Round Error
ru: Погрешность

# equalsOperatorTitle
source: equals
ru: равно

# notEqualsOperatorTitle
source: is not
ru: не равно

# greaterThanOperatorTitle
source: is greater than
ru: больше чем

# lessThanOperatorTitle
source: is less than
ru: меньше чем

# undoDataTypeChangeAction
source: Data Type Change
ru: Изменение типа данных

# clearSearchVariablesTitle
source: Clear Search Variables
ru: Очистить поиск

# clearVariablesTitle
source: Clear Variables
ru: Очистить переменные

# freezeSingleVariableTitle
source: Freeze Variable
ru: Заморозить переменную

# freezeMulitipleVariablesTitle
source: Freeze Variables
ru: Заморозить переменные

# unfreezeSingleVariableTitle
source: Unfreeze Variable
ru: Разморозить переменную

# unfreezeMultipleVariablesTitle
source: Unfreeze Variables
ru: Разморозить переменные

# editSingleVariableValueTitle
source: Edit Variable Value…
ru: Изменить значение…

# editMultipleVariableValuesTitle
source: Edit Variable Values…
ru: Изменить значения…

# editSingleVariableSizeTitle
source: Edit Variable Size…
ru: Изменить размер переменной…

# editMultipleVariableSizesTitle
source: Edit Variable Sizes…
ru: Изменить размер переменных…

# relativizeSingleVariableTitle
source: Relativize Variable
ru: Релятивизировать переменную

# relativizeMultipleVariablesTitle
source: Relativize Variables
ru: Релятивизировать переменные

# nopSingleVariableTitle
source: NOP Variable
ru: NOP-переменная

# nopMultipleVariablesTitle
source: NOP Variables
ru: NOP-переменные

# previousOperatorMenuItem
source: Previous Operator
ru: Предыдущий оператор

# nextOperatorMenuItem
source: Next Operator
ru: Следующий оператор

# storedValueTokenTitle
source: Stored Value
ru: Сохраненное значение

# storeValuesButtonToolTip
source: Store all the values from the target, so you can later make searches based on how these values change
ru: Сделать снимок всех значений присутствующих в памяти. Это поможет, не зная величин, находить нужные значения по их отклонению от первоначальных

# noStoredValuesAlertTitle
source: No Stored Values Available
ru: Нет таких значений, среди сохраненных

# noStoredValuesAlertMessage
source: No stored values are available to compare against. Please store values first before proceeding.
ru: Нет сохраненых значений для сравнения. Пожалуйста, сделайте снимок всех значений прежде чем продолжить.

# searchFinishedNotificationTitle
source: Search Finished
ru: Поиск завершен

# undoSearchAction
source: Search
ru: Поиск

# beginningAddressLabel
source: Beginning Address
ru: Начальный адрес

# endingAddressLabel
source: Ending Address
ru: Конечный адрес

# invalidFlagsFieldErrorMessageFormat
source: The value corresponding to '%@' needs to be a valid expression or left empty.
ru: Значение, соответствующее '%@' должно быть правильным выражением или оставаться пустым.

# endingAddressIsNotGreaterThanBeginningAddressErrorMessage
source: The value in the Beginning Address field must be less than the value in the Ending Address field, or one or both of the fields can be omitted.
ru: Значение Начального адреса должно быть меньше, чем значение в Конечном адресе, либо одно или оба поля можгут оставаться пустыми.

# invalidNumericalSearchExpressionErrorMessage
source: The search value is not a valid numerical expression.
ru: Поисковое значение должно быть числовым.

# storedValueSearchUnsupportedForByteArrays
source: Comparing Stored Values is not supported for Byte Arrays
ru: Сравнение сохраненных значений не работает для Байтовых массивов

# storedValueSearchUnsupportedForStrings
source: Comparing Stored Values is not supported for Strings
ru: Сравнение сохраненных значений не работает для Строк

# linearExpressionParseFailureErrorMessage
source: The search expression could not be parsed properly. Please try a simpler expression.
ru: Выражение поиска не может быть разобрано. Пожалуйста, попробуйте более простое выражение.

# invalidSearchInputAlertTitle
source: Invalid Search Input
ru: Неверный поисковый запрос

# cancelingSearchStatusLabel
source: Cancelling search…
ru: Отмена поиска…

# cancelingStoringValuesStatusLabel
source: Cancelling Storing Values…
ru: Отмена снимка значений…

# storingValuesStatusLabel
source: Storing All Values…
ru: Сохранение всех значений…

# searchFailureAlertTitle
source: Search Failure
ru: Ошибка поиска

# searchFailureSystemProtectionAlertMessageFormat
source: %@'s memory cannot be searched due to system protections.
ru: Память %@ не может быть найдена из-за системных защит.
