Repository: sandiz/Bit-Slicer
Catalog: Bit Slicer/*.lproj/[Code] Watch Variable.strings
Languages: ru

# targetTeriminatedAlertTitleFormat
source: %@ Terminated
ru: %@ Прерван

# targetTeriminatedAlertMessage
source: Do you want to add the found instructions to this document?
ru: Хотите добавить найденные инструкции к этому документу?

# targetTeriminatedAlertAddButton
source: Add
ru: Добавить

# generalPurposeRegistersDescriptionLabel
source: General Purpose Registers
ru: Регистры общего назначения

# floatAndVectorRegistersDescriptionLabel
source: Float/Vector Registers
ru: Float/Vector регистры

# firstRegisterAccessLabel
source: (1st access)
ru: (первый доступ)

# foundInstructionNotificationTitle
source: Found Instruction
ru: Найдены инструкции

# foundInstructionNotificationMessageFormat
source: Found instruction "%@"
ru: Найдены инструкции "%@"

# failedToWatchVariableAlertTitle
source: Failed to Watch Variable
ru: Не удалось Следить за пременной

# failedToWatchVariableAlertMessage
source: A watchpoint could not be added for this variable at this time.
ru: Точка наблюдения не может быть добавлена для этой переменной в данный момент.

# watchWriteAccessesStatusFormat
source: Watching %lld-bit write accesses at %@…
ru: Слежение %lld-бит запись в %@…

# watchReadAndWriteAccessesStatusFormat
source: Watching %lld-bit read and write accesses at %@…
ru: Слежение %lld-бит чтение и запись в %@…
